 



INTERNET-DRAFT                                             A. Malis, ed.
Intended Status: Proposed Standard                Verizon Communications
Expires: December 27, 2010                                A. Lindem, ed.
                                                                Ericsson
                                                           June 25, 2010


       Updates to ASON Routing for OSPFv2 Protocols (RFC 5787bis)
                  draft-malis-ccamp-rfc5787bis-00.txt


Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as
   Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html


Copyright and License Notice

   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors. All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document. Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document. Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

 


Malis                  Expires December 27, 2010                [Page 1]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


Abstract

   The ITU-T has defined an architecture and requirements for operating
   an Automatically Switched Optical Network (ASON).

   The Generalized Multiprotocol Label Switching (GMPLS) protocol suite
   is designed to provide a control plane for a range of network
   technologies including optical networks such as time division
   multiplexing (TDM) networks including SONET/SDH and Optical Transport
   Networks (OTNs), and lambda switching optical networks.

   The requirements for GMPLS routing to satisfy the requirements of
   ASON routing, and an evaluation of existing GMPLS routing protocols
   are provided in other documents.  This document defines extensions to
   the OSPFv2 Link State Routing Protocol to meet the requirements for
   routing in an ASON.

   Note that this work is scoped to the requirements and evaluation
   expressed in RFC 4258 and RFC 4652 and the ITU-T Recommendations
   current when those documents were written.  Future extensions of
   revisions of this work may be necessary if the ITU-T Recommendations
   are revised or if new requirements are introduced into a revision of
   RFC 4258.


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 4
      1.1.  Conventions Used in This Document  . . . . . . . . . . . . 5
   2.  Routing Areas, OSPF Areas, and Protocol Instances . . . . . . . 5
   3.  Terminology and Identification  . . . . . . . . . . . . . . . . 5
   4.  Reachability  . . . . . . . . . . . . . . . . . . . . . . . . . 6
   5.  Link Attribute  . . . . . . . . . . . . . . . . . . . . . . . . 7
      5.1.  Local Adaptation . . . . . . . . . . . . . . . . . . . . . 7
      5.2.  Bandwidth Accounting . . . . . . . . . . . . . . . . . . . 8
   6.  Routing Information Scope . . . . . . . . . . . . . . . . . . . 8
      6.1.  Link Advertisement (Local and Remote TE Router ID 
            Sub-TLV) . . . . . . . . . . . . . . . . . . . . . . . . . 8
      6.2.  Reachability Advertisement (Local TE Router ID sub-TLV)  . 9
   7.  Routing Information Dissemination . . . . . . . . . . . . . .  10
      7.1  Import/Export Rules . . . . . . . . . . . . . . . . . . .  10
      7.2  Loop Prevention . . . . . . . . . . . . . . . . . . . . .  11
         7.2.1  Inter-RA Export Upward/Downward Sub-TLVs . . . . . .  11
         7.2.2  Inter-RA Export Upward/Downward Sub-TLV Processing .  12
   8.  OSPFv2 Scalability  . . . . . . . . . . . . . . . . . . . . .  12
   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  13
   10.  IANA Considerations  . . . . . . . . . . . . . . . . . . . .  13
      10.1.  Sub-TLVs of the Link TLV  . . . . . . . . . . . . . . .  14
 


Malis                  Expires December 27, 2010                [Page 2]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


      10.2.  Sub-TLVs of the Node Attribute TLV  . . . . . . . . . .  14
      10.3.  Sub-TLVs of the Router Address TLV  . . . . . . . . . .  14
   11.  References . . . . . . . . . . . . . . . . . . . . . . . . .  15
      11.2.  Informative References  . . . . . . . . . . . . . . . .  16
   12.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  17
   Appendix A.  ASON Terminology . . . . . . . . . . . . . . . . . .  18
   Appendix B.  ASON Routing Terminology . . . . . . . . . . . . . .  19
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  20








































 


Malis                  Expires December 27, 2010                [Page 3]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


1.  Introduction

   The Generalized Multiprotocol Label Switching (GMPLS) [RFC3945]
   protocol suite is designed to provide a control plane for a range of
   network technologies including optical networks such as time division
   multiplexing (TDM) networks including SONET/SDH and Optical Transport
   Networks (OTNs), and lambda switching optical networks.

   The ITU-T defines the architecture of the Automatically Switched
   Optical Network (ASON) in [G.8080].

   [RFC4258] details the routing requirements for the GMPLS suite of
   routing protocols to support the capabilities and functionality of
   ASON control planes identified in [G.7715] and in [G.7715.1].

   [RFC4652] evaluates the IETF Link State routing protocols against the
   requirements identified in [RFC4258].  Section 7.1 of [RFC4652]
   summarizes the capabilities to be provided by OSPFv2 [RFC2328] in
   support of ASON routing.  This document details the OSPFv2 specifics
   for ASON routing.

   Multi-layer transport networks are constructed from multiple networks
   of different technologies operating in a client-server relationship.
   The ASON routing model includes the definition of routing levels that
   provide scaling and confidentiality benefits.  In multi-level
   routing, domains called routing areas (RAs) are arranged in a
   hierarchical relationship.  Note that as described in [RFC4652],
   there is no implied relationship between multi-layer transport
   networks and multi-level routing.  The multi-level routing mechanisms
   described in this document work for both single-layer and multi-layer
   networks.

   Implementations may support a hierarchical routing topology (multi-
   level) for multiple transport network layers and/or a hierarchical
   routing topology for a single transport network layer.

   This document details the processing of the generic (technology-
   independent) link attributes that are defined in [RFC3630],
   [RFC4202], and [RFC4203] and that are extended in this document.  As
   detailed in Section 5.2, technology-specific traffic engineering
   attributes and their processing may be defined in other documents
   that complement this document.

   Note that this work is scoped to the requirements and evaluation
   expressed in [RFC4258] and [RFC4652] and the ITU-T Recommendations
   current when those documents were written.  Future extensions of
   revisions of this work may be necessary if the ITU-T Recommendations
   are revised or if new requirements are introduced into a revision of
 


Malis                  Expires December 27, 2010                [Page 4]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   [RFC4258].

1.1.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

   The reader is assumed to be familiar with the terminology and
   requirements developed in [RFC4258] and the evaluation outcomes
   detailed in [RFC4652].

   General ASON terminology is provided in Appendix A.  ASON routing
   terminology is described in Appendix B.

2.  Routing Areas, OSPF Areas, and Protocol Instances

   An ASON routing area (RA) represents a partition of the data plane,
   and its identifier is used within the control plane as the
   representation of this partition.

   RAs are arranged in hierarchical levels such that any one RA may
   contain multiple other RAs, and is wholly contained by a single RA.
   Thus, an RA may contain smaller RAs inter-connected by links.  The
   limit of the subdivision results in an RA that contains just two sub-
   networks interconnected by a single link.

   An ASON RA can be mapped to an OSPF area, but the hierarchy of ASON
   RA levels does not map to the hierarchy of OSPF areas. Instead,
   successive hierarchical levels of RAs MUST be represented by separate
   instances of the protocol.  Thus, inter-level routing information
   exchange (as described in Section 7) involves the export and import
   of routing information between protocol instances.

   An ASON RA may therefore be identified by the combination of its OSPF
   instance identifier and its OSPF area identifier.  With proper and
   careful network-wide configuration, this can be achieved using just
   the OSPF area identifier, and this process is RECOMMENDED in this
   document.  These concepts are discussed in Section 7.

3.  Terminology and Identification

   The definition of short-hand terminology introduced in [RFC4652] is
   repeated here for clarity.

   - Pi is a physical (bearer/data/transport plane) node.


 


Malis                  Expires December 27, 2010                [Page 5]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   - Li is a logical control plane entity that is associated to a single
     data plane (abstract) node.  Each Li is identified by a unique TE
     Router ID.  The latter is a control plane identifier, defined as
     the Router Address top-level TLV (Type 1) of the Traffic
     Engineering (TE) Link State Advertisement (LSA) [RFC3630].

     Note: The Router Address top-level TLV definition, processing, and
     usage remain per [RFC3630].  This TLV specifies a stable IP address
     of the advertising router (Ri) that is always reachable if there is
     any IP connectivity to it (e.g., via the Data Communication
     Network).  Moreover, each advertising router advertises a unique,
     reachable IP address for each Pi on behalf of which it advertises
     topology information.

   - Ri is a logical control plane entity that is associated to an OSPF
     control plane router.  The latter is the source for topology
     information that it generates and shares with other OSPF control
     plane routers.  The Ri is identified by the advertising Router ID
     as defined in [RFC2328].

     The Router ID, which is represented by Ri and which corresponds to
     the RC-ID [RFC4258], does not enter into the identification of the
     logical entities representing the data plane resources such as
     links.  The Routing Database (RDB) is associated with the Ri.

   Note: Aside from the Li/Pi mappings, these identifiers are not
   assumed to be in a particular entity relationship except that the Ri
   may have multiple Li's in its scope.  The relationship between Ri and
   Li is simple at any moment in time: an Li may be advertised by only
   one Ri at any time.  However, an Ri may advertise a set of one or
   more Li's.  Hence, the OSPFv2 routing protocol must support a single
   Ri advertising on behalf of more than one Li.

4.  Reachability

   In order to advertise blocks of reachable address prefixes, a
   summarization mechanism is introduced that is based on the techniques
   described in [RFC5786]. For ASON reachability advertisement, blocks
   of reachable address prefixes are advertised together with the
   associated data plane node. The data plane node is identified in the
   control plane by its TE Router ID, as discussed in section 6.

   In order to support ASON reachability advertisement, the Node
   Attribute TLV defined in [RFC5786] is used to advertise the
   combination of a TE Router ID and its set of associated reachable
   address prefixes. The Node Attribute TLV can contain the following
   sub-TLVs:

 


Malis                  Expires December 27, 2010                [Page 6]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


      - TE Router ID sub-TLV: Length: 4; Defined in Section 6.2
      - Node IPv4 Local Address sub-TLV: Length: variable; [RFC5786]
      - Node IPv6 Local Address sub-TLV: Length: variable; [RFC5786]

   A router may support multiple data plane nodes as discussed in
   section 5, and as a result may be required to advertise reachability
   separately for multiple TE Router ID values. As a consequence, it
   MUST be possible for the router to originate more than one TE LSA
   containing the Node Attribute TLV when used for ASON reachability
   advertisement.

   Hence, the Node Attribute TLV [RFC5786] advertisement rules must be
   relaxed for ASON. A Node Attribute TLV MAY appear in more than one TE
   LSA originated by the RC when the RC is advertising reachability
   information for a different logical control plane entity (Li)
   identified by the Local TE Router Sub-TLV (refer to section 6.1).

5.  Link Attribute

   [RFC4652] provides a map between link attributes and characteristics
   and their representation in sub-TLVs of the top-level Link TLV
   advertised in TE LSAs [RFC3630] and [RFC4203], with the exception of
   the local adaptation (refer to Section 5.1).  Advertisement of this
   information SHOULD be supported on a per-layer basis, i.e., one TE
   LSA per switching capability (and per bandwidth granularity, e.g.,
   low-order virtual container and high-order virtual container).

5.1.  Local Adaptation

   Local adaptation is defined as a TE link attribute (i.e., sub-TLV)
   that describes the cross/inter-layer relationships.

   The Interface Switching Capability Descriptor (ISCD) TE Attribute
   [RFC4202] identifies the ability of the TE link to support cross-
   connection to another link within the same layer, and the ability to
   use a locally terminated connection that belongs to one layer as a
   data link for another layer (adaptation capability).  However, the
   information associated with the ability to terminate connections
   within that layer (referred to as the termination capability) is
   embedded with the adaptation capability.

   For instance, a link between two optical cross-connects will contain
   at least one ISCD attribute describing the lambda switching capable
   (LSC) switching capability; whereas a link between an optical cross-
   connect and an IP/MPLS Label Switch Router (LSR) will contain at
   least two ISCD attributes:


 


Malis                  Expires December 27, 2010                [Page 7]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   one for the description of the LSC termination capability and one for
   the packet switching capable (PSC) adaptation capability.

   In OSPFv2, the Interface Switching Capability Descriptor (ISCD) is a
   sub-TLV (type 15) of the top-level Link TLV (type 2) [RFC4203].

   The adaptation and termination capabilities are advertised using two
   separate ISCD sub-TLVs within the same top-level Link TLV.

   Per [RFC4202] and [RFC4203], an interface MAY have more than one ISCD
   sub-TLV.  Hence, the corresponding advertisements should not result
   in any compatibility issues. However, some link types may support
   several different signal types that are modeled as separate layers in
   the G.805 model [G.805] (e.g., SDH links may simultaneously support
   VC-3, VC-4, VC-4-4c, VC-4-16c and VC-4-64c signals).  Optimization
   refinements to reduce the overhead of advertising link
   characteristics separately for each signal type may be defined.

   Further refinement of the ISCD sub-TLV for multi-layer networks is
   outside the scope of this document.

5.2.  Bandwidth Accounting

   GMPLS routing defines an Interface Switching Capability Descriptor
   (ISCD) that delivers, among other things, information about the
   (maximum/minimum) bandwidth per priority that a Label Switched Path
   (LSP) can use. Per [RFC4202] and [RFC4203], one or more ISCD sub-TLVs
   can be associated with an interface.  This information, combined with
   the Unreserved Bandwidth (sub-TLV defined in [RFC3630], Section
   2.5.8), provides the basis for bandwidth accounting.

   In the ASON context, additional information may be included when the
   representation and information in the other advertised fields are not
   sufficient for a specific technology (e.g., SDH).  The definition of
   technology-specific information elements is beyond the scope of this
   document.  Some technologies will not require additional information
   beyond what is already defined in [RFC3630], [RFC4202], and
   [RFC4203].

6.  Routing Information Scope

6.1.  Link Advertisement (Local and Remote TE Router ID Sub-TLV)

   A Router ID (Ri) advertising on behalf multiple TE Router IDs (Li's)
   creates a 1:N relationship between the Router ID and the TE Router
   ID.  As the link local and link remote (unnumbered) ID association is
   not unique per node (per Li), the advertisement needs to indicate the
   remote Lj value and rely on the initial discovery process to retrieve
 


Malis                  Expires December 27, 2010                [Page 8]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   the [Li;Lj] relationship.  In brief, as unnumbered links have their
   ID defined on a per-Li basis, the remote Lj needs to be identified to
   scope the link remote ID to the local Li.  Therefore, the routing
   protocol MUST be able to disambiguate the advertised TE links so that
   they can be associated with the correct TE Router ID.

   For this purpose, a new sub-TLV of the OSPFv2 TE LSA top-level Link
   TLV is introduced that defines the Local and Remote TE Router ID.

   The Type field of the Local and Remote TE Router ID sub-TLV is
   assigned a value TBD.  The Length field takes the value 8.  The Value
   field of this sub-TLV contains 4 octets of the Local TE Router
   Identifier followed by 4 octets of the Remote TE Router Identifier. 
   The value of the Local and Remote TE Router Identifier SHOULD NOT be
   set to 0.

   The format of the Local and Remote TE Router ID sub-TLV is:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |          Length (8)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Local TE Router Identifier                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Remote TE Router Identifier                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   This sub-TLV MUST be included as a sub-TLV of the top-level Link TLV
   if the Router ID is advertising on behalf of more than one TE Router
   ID.  This sub-TLV SHOULD be omitted if the Ri is only advertising on
   behalf of a single Li. 

   Note: The Link ID sub-TLV that identifies the other end of the link
   (i.e., Router ID of the neighbor for point-to-point links) MUST
   appear exactly once per Link TLV.  This sub-TLV MUST be processed as
   defined in [RFC3630].

6.2.  Reachability Advertisement (Local TE Router ID sub-TLV)

   When the Router ID is advertised on behalf of multiple TE Router IDs
   (Li's), the routing protocol MUST be able to associate the advertised
   reachability information with the correct TE Router ID.

   For this purpose, a new sub-TLV of the OSPFv2 TE LSA top-level Node
   Attribute TLV is introduced.  This TLV associates the local prefixes
   (see above) to a given TE Router ID.

 


Malis                  Expires December 27, 2010                [Page 9]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   The Type field of the Local TE Router ID sub-TLV is assigned a value
   TBD.  The Length field takes the value 4.  The Value field of this
   sub-TLV contains the Local TE Router Identifier [RFC3630] encoded
   over 4 octets.

   The format of the Local TE Router ID sub-TLV is:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |          Length (4)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Local TE Router Identifier                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   This sub-TLV is only required to be included as part of the Node
   Attribute TLV if the Router ID is advertising on behalf of more than
   one TE Router ID.  In any other case, this sub-TLV SHOULD be omitted.

7.  Routing Information Dissemination

   An ASON routing area (RA) represents a partition of the data plane,
   and its identifier is used within the control plane as the
   representation of this partition.  An RA may contain smaller RAs
   inter-connected by links.  ASON RA levels do not map directly to OSPF
   areas. Rather, hierarchical levels of RAs are represented by separate
   OSPF protocol instances.

   Routing controllers (RCs) supporting RAs disseminate information
   downward and upward in this ASON hierarchy.  The vertical routing
   information dissemination mechanisms described in this section do not
   introduce or imply hierarchical OSPF areas.  RCs supporting RAs at
   multiple levels are structured as separate OSPF instances with
   routing information exchange between levels described by import and
   export rules between these instances. The functionality described
   herein does not pertain to OSPF areas or OSPF Area Border Router
   (ABR) functionality.

7.1  Import/Export Rules

   RCs supporting RAs disseminate information upward and downward in the
   hierarchy by importing/exporting routing information as TE LSAs. TE
   LSAs are area-scoped opaque LSAs with opaque type 1 [RFC3630]. The
   information that MAY be exchanged between adjacent levels includes
   the Router Address, Link, and Node Attribute top-level TLVs.

   The imported/exported routing information content MAY be transformed,
   e.g., filtered or aggregated, as long as the resulting routing
 


Malis                  Expires December 27, 2010               [Page 10]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   information is consistent.  In particular, when more than one RC is
   bound to adjacent levels and both are allowed to import/export
   routing information, it is expected that these transformations are
   performed in a consistent manner.  Definition of these policy-based
   mechanisms is outside the scope of this document.

   In practice, and in order to avoid scalability and processing
   overhead, routing information imported/exported downward/upward in
   the hierarchy is expected to include reachability information (see
   Section 4) and, upon strict policy control, link topology
   information.

7.2  Loop Prevention

   When more than one RC is bound to an adjacent level of the ASON
   hierarchy, and is configured to export routing information upward or
   downward, a specific mechanism is required to avoid looping of
   routing information.  Looping is the re-advertisement of routing
   information into an RA that had previously advertised that routing
   information upward or downward into an upper or lower level RA in the
   ASON hierarchy. For example, without loop prevention mechanisms, this
   could happen when the RC advertising routing information downward in
   the hierarchy is not the same one that advertises routing upward in
   the hierarchy.

7.2.1  Inter-RA Export Upward/Downward Sub-TLVs

   The Inter-RA Export Sub-TLVs can be used to prevent the re-
   advertisement of OSPF TE routing information into an RA which
   previously advertised that information. The type value TBD will
   indicate that the associated routing information has been exported
   downward. The type value TBD will indicate that the associated
   routing information has been exported upward. While it is not
   required for routing information exported downward, both Sub-TLVs
   will include the Routing Area (RA) ID from the which the routing
   information was exported.  This RA is not necessarily the RA
   originating the routing information but RA from which the information
   was immediately exported.

   These additional Sub-TLVs MAY be carried in TE LSAs that include any
   of the following top-level TLVs:

      - Router Address top-level TLV
      - Link top-level TLV
      - Node Attribute top-level TLV

   The Type field of the Inter-RA Export Upward and Inter-RA Export
   Downward sub-TLVs are respectively assigned the values TBD1 and TBD2.
 


Malis                  Expires December 27, 2010               [Page 11]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   The Length of the Associated RA ID TLV is 4 octets. The Value field
   in these sub-TLVs contains the associated RA ID. The RA ID value must
   be a unique identifier for the RA within the ASON routing domain.

   The format of the Inter-RA Export Upward and Inter-RA Export Downward
   Sub-TLVs is graphically depicted below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Upward/Downward Type       |           Length (4)          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Associated RA ID                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

7.2.2  Inter-RA Export Upward/Downward Sub-TLV Processing

   TE LSAs MAY be imported or exported downward or upward in the ASON
   routing hierarchy. The direction and advertising RA ID are advertised
   in an Inter-RA Export Upward/Downward Sub-TLV. They MUST be retained
   by the receiving RA with the associated routing information.

   When exporting routing information upward in the ASON routing
   hierarchy, any information received from a level above, i.e., tagged
   with an Inter-RA Export Downward Sub-TLV, MUST NOT be exported
   upward. Since an RA at level N is contained by a single RA at level
   N+1, this is the only checking that is necessary and the associated
   RA ID is used solely for informational purposes.

   When exporting routing information downward in the ASON routing
   hierarchy, any information received from a level below, i.e., tagged
   with an Inter-RA Expert Upward Sub-TLV MUST NOT be exported downward
   if the target RA ID matches the RA ID associated with the routing
   information. This additional checking is required for routing
   information exported downward since a single RA at level N+1 may
   contain multiple RAs at level N in the ASON routing hierarchy.  In
   order words, routing information MUST NOT be exported downward into
   the RA from which it was received.

8.  OSPFv2 Scalability

   The extensions described herein are only applicable to ASON routing
   domains and it is not expected that the attendant Ri/Li reachability
   and link information will ever be mixed with global or local IP
   routing information.  If there ever were a requirement for a given RC
   to participate in both domains, separate OSPFv2 instances would be
   utilized.  However, in a multi-level ASON hierarchy, the potential
   volume of information could be quite large and the recommendations in
 


Malis                  Expires December 27, 2010               [Page 12]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   this section SHOULD be followed by RC implementing this
   specification.

   - Routing information exchange upward/downward in the hierarchy
     between adjacent RAs SHOULD, by default, be limited to reachability
     information.  In addition, several transformations such as prefix
     aggregation are RECOMMENDED to reduce the amount of information
     imported/exported by a given RC when such transformations will not
     impact consistency.

   - Routing information exchange upward/downward in the ASON hierarchy
     involving TE attributes MUST be under strict policy control. 
     Pacing and min/max thresholds for triggered updates are strongly
     RECOMMENDED.

   - The number of routing levels MUST be maintained under strict policy
     control.

9.  Security Considerations

   This document specifies the contents and processing of OSPFv2 TE LSAs
   [RFC3630] and [RFC4202].  The TE LSA extensions defined in this
   document are not used for SPF computation, and have no direct effect
   on IP routing.  Additionally, ASON routing domains are delimited by
   the usual administrative domain boundaries.

   Any mechanisms used for securing the exchange of normal OSPF LSAs can
   be applied equally to all TE LSAs used in the ASON context. 
   Authentication of OSPFv2 LSA exchanges (such as OSPF cryptographic
   authentication [RFC2328] and [RFC5709]) can be used to secure against
   passive attacks and provide significant protection against active
   attacks.  [RFC5709] defines a mechanism for authenticating OSPFv2
   packets by making use of the HMAC algorithm in conjunction with the
   SHA family of cryptographic hash functions.

   If a stronger authentication were believed to be required, then the
   use of a full digital signature [RFC2154] would be an approach that
   should be seriously considered.  Use of full digital signatures would
   enable precise authentication of the OSPF router originating each
   OSPF link-state advertisement, and thereby provide much stronger
   integrity protection for the OSPF routing domain.

10.  IANA Considerations

   This document is classified as Standards Track.  It defines new sub-
   TLVs for inclusion in OSPF TE LSAs.  According to the assignment
   policies for the registries of code points for these sub-TLVs, values
   must be assigned by IANA [RFC3630].
 


Malis                  Expires December 27, 2010               [Page 13]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   The following subsections summarize the required sub-TLVs.

10.1.  Sub-TLVs of the Link TLV

   This document defines the following sub-TLVs of the Link TLV
   advertised in the OSPF TE LSA:

   - Local and Remote TE Router ID sub-TLV
   - Associated RA ID sub-TLV
   - Inter-RA Export Upward sub-TLV
   - Inter-RA Export Downward sub-TLV

   Codepoints for these Sub-TLVs should be allocated from the "Types for
   sub-TLVs of TE Link TLV (Value 2)" registry standards action range (0
   - 32767) [RFC3630].

   Note that the same values for the Associated RA ID sub-TLV, Inter-RA
   Export Upward sub-TLV, and Inter-RA Export Downward Sub-TLV MUST be
   used when they appear in the Link TLV, Node Attribute TLV, and Router
   Address TLV.

10.2.  Sub-TLVs of the Node Attribute TLV

   This document defines the following sub-TLVs of the Node Attribute
   TLV advertised in the OSPF TE LSA:

      - Local TE Router ID sub-TLV
      - Associated RA ID sub-TLV
      - Inter-RA Export Upward sub-TLV
      - Inter-RA Export Downward sub-TLV

   Codepoints for these Sub-TLVs should be assigned from the "Types for
   sub-TLVs of TE Node Attribute TLV (Value 5)" registry standards
   action range (0 - 32767) [RFC5786].

   Note that the same values for the Associated RA ID sub-TLV, Inter-RA
   Export Upward sub-TLV, and Inter-RA Export Downward Sub-TLV MUST be
   used when they appear in the Link TLV, Node Attribute TLV, and Router
   Address TLV.

10.3.  Sub-TLVs of the Router Address TLV

   The Router Address TLV is advertised in the OSPF TE LSA [RFC3630]. 
   Since this TLV currently has no Sub-TLVs defined, a "Types for sub-
   TLVs of Router Address TLV (Value 1)" registry must be defined.

   The registry guidelines for the assignment of types for sub-TLVs of
   the Router Address TLV are as follows:
 


Malis                  Expires December 27, 2010               [Page 14]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


      o  Types in the range 0-32767 are to be assigned via Standards
         Action.

      o  Types in the range 32768-32777 are for experimental use; these
         will not be registered with IANA, and MUST NOT be mentioned by
         RFCs.

      o  Types in the range 32778-65535 are not to be assigned at this
         time.  Before any assignments can be made in this range, there
         MUST be a Standards Track RFC that specifies IANA
         Considerations that covers the range being assigned.

   This document defines the following sub-TLVs for inclusion in the
   Router Address TLV:

      - Associated RA ID sub-TLV
      - Inter-RA Export Upward sub-TLV
      - Inter-RA Export Downward sub-TLV

   Codepoints for these Sub-TLVs should be allocated from the "Types for
   sub-TLVs of Router Address TLV (Value 1)" registry standards action
   range (0 - 32767).

   Note that the same values for the Associated RA ID sub-TLV, Inter-RA
   Export Upward sub-TLV, and Inter-RA Export Downward Sub-TLV MUST be
   used when they appear in the Link TLV, Node Attribute TLV, and Router
   Address TLV.

11.  References

11.1.  Normative References

   [RFC2119]    Bradner, S., "Key words for use in RFCs to Indicate
                Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2328]    Moy, J., "OSPF Version 2", STD 54, RFC 2328, April 1998.

   [RFC3630]    Katz, D., Kompella, K., and D. Yeung, "Traffic
                Engineering (TE) Extensions to OSPF Version 2", RFC
                3630, September 2003.

   [RFC3945]    Mannie, E., Ed., "Generalized Multi-Protocol Label
                Switching (GMPLS) Architecture", RFC 3945, October 2004.

   [RFC4202]    Kompella, K., Ed., and Y. Rekhter, Ed., "Routing
                Extensions in Support of Generalized Multi-Protocol
                Label Switching (GMPLS)", RFC 4202, October 2005.

 


Malis                  Expires December 27, 2010               [Page 15]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   [RFC4203]    Kompella, K., Ed., and Y. Rekhter, Ed., "OSPF Extensions
                in Support of Generalized Multi-Protocol Label Switching
                (GMPLS)", RFC 4203, October 2005.

   [RFC5786]    Aggarwal, R. and K. Kompella, "Advertising a Router's
                Local Addresses in OSPF TE Extensions", RFC 5786, March
                2010.

11.2.  Informative References

   [RFC2154]    Murphy, S., Badger, M., and B. Wellington, "OSPF with
                Digital Signatures", RFC 2154, June 1997.

   [RFC4258]    Brungard, D., Ed., "Requirements for Generalized Multi-
                Protocol Label Switching (GMPLS) Routing for the
                Automatically Switched Optical Network (ASON)", RFC
                4258, November 2005.

   [RFC4652]    Papadimitriou, D., Ed., Ong, L., Sadler, J., Shew, S.,
                and D. Ward, "Evaluation of Existing Routing Protocols
                against Automatic Switched Optical Network (ASON)
                Routing Requirements", RFC 4652, October 2006.

   [RFC5709]    Bhatia, M., Manral, V., Fanto, M., White, R., Barnes,
                M., Li, T., and R. Atkinson, "OSPFv2 HMAC-SHA
                Cryptographic Authentication", RFC 5709, October 2009.

   For information on the availability of ITU Documents, please see
   http://www.itu.int.

   [G.7715]     ITU-T Rec. G.7715/Y.1306, "Architecture and Requirements
                for the Automatically Switched Optical Network (ASON)",
                June 2002.

   [G.7715.1]   ITU-T Draft Rec. G.7715.1/Y.1706.1, "ASON Routing
                Architecture and Requirements for Link State Protocols",
                November 2003.

   [G.805]      ITU-T Rec. G.805, "Generic functional architecture of
                transport networks)", March 2000.

   [G.8080]     ITU-T Rec. G.8080/Y.1304, "Architecture for the
                Automatically Switched Optical Network (ASON)," November
                2001 (and Revision, January 2003).




 


Malis                  Expires December 27, 2010               [Page 16]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


12.  Acknowledgements

   The editors would like to thank Dimitri Papadimitriou for editing RFC
   5787, from which this document is derived, and Lyndon Ong and Remi
   Theillaud for their useful comments and suggestions.











































 


Malis                  Expires December 27, 2010               [Page 17]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


Appendix A.  ASON Terminology

   This document makes use of the following terms:

   Administrative domain: (See Recommendation [G.805].)  For the
      purposes of [G7715.1], an administrative domain represents the
      extent of resources that belong to a single player such as a
      network operator, a service provider, or an end-user. 
      Administrative domains of different players do not overlap amongst
      themselves.

   Control plane: performs the call control and connection control
      functions.  Through signaling, the control plane sets up and
      releases connections, and may restore a connection in case of a
      failure.

   (Control) Domain: represents a collection of (control) entities that
      are grouped for a particular purpose.  The control plane is
      subdivided into domains matching administrative domains.  Within
      an administrative domain, further subdivisions of the control
      plane are recursively applied.  A routing control domain is an
      abstract entity that hides the details of the RC distribution.

   External NNI (E-NNI): interfaces located between protocol controllers
      between control domains.

   Internal NNI (I-NNI): interfaces located between protocol controllers
      within control domains.

   Link: (See Recommendation G.805.)  A "topological component" that
      describes a fixed relationship between a "subnetwork" or "access
      group" and another "subnetwork" or "access group".  Links are not
      limited to being provided by a single server trail.

   Management plane: performs management functions for the transport
      plane, the control plane, and the system as a whole.  It also
      provides coordination between all the planes.  The following
      management functional areas are performed in the management plane:
      performance, fault, configuration, accounting, and security
      management.

   Management domain: (See Recommendation G.805.)  A management domain
      defines a collection of managed objects that are grouped to meet
      organizational requirements according to geography, technology,
      policy, or other structure, and for a number of functional areas
      such as configuration, security, (FCAPS), for the purpose of
      providing control in a consistent manner.  Management domains can
      be disjoint, contained, or overlapping.  As such, the resources
 


Malis                  Expires December 27, 2010               [Page 18]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


      within an administrative domain can be distributed into several
      possible overlapping management domains.  The same resource can
      therefore
      belong to several management domains simultaneously, but a
      management domain shall not cross the border of an administrative
      domain.

   Subnetwork Point (SNP): The SNP is a control plane abstraction that
      represents an actual or potential transport plane resource.  SNPs
      (in different subnetwork partitions) may represent the same
      transport resource.  A one-to-one correspondence should not be
      assumed.

   Subnetwork Point Pool (SNPP): A set of SNPs that are grouped together
      for the purposes of routing.

   Termination Connection Point (TCP): A TCP represents the output of a
      Trail Termination function or the input to a Trail Termination
      Sink function.

   Transport plane: provides bidirectional or unidirectional transfer of
      user information, from one location to another.  It can also
      provide transfer of some control and network management
      information. The transport plane is layered; it is equivalent to
      the Transport Network defined in Recommendation G.805.

   User Network Interface (UNI): interfaces are located between protocol
      controllers between a user and a control domain.  Note: There is
      no routing function associated with a UNI reference point.

Appendix B.  ASON Routing Terminology

   This document makes use of the following terms:

   Routing Area (RA): an RA represents a partition of the data plane,
      and its identifier is used within the control plane as the
      representation of this partition.  Per [G.8080], an RA is defined
      by a set of sub-networks, the links that interconnect them, and
      the interfaces representing the ends of the links exiting that RA.
       An RA may contain smaller RAs inter-connected by links.  The
      limit of subdivision results in an RA that contains two sub-
      networks interconnected by a single link.

   Routing Database (RDB): a repository for the local topology, network
      topology, reachability, and other routing information that is
      updated as part of the routing information exchange and may
      additionally contain information that is configured.  The RDB may
      contain routing information for more than one routing area (RA).
 


Malis                  Expires December 27, 2010               [Page 19]

INTERNET DRAFT                 RFC5787bis                  June 25, 2010


   Routing Components: ASON routing architecture functions.  These
      functions can be classified as protocol independent (Link Resource
      Manager or LRM, Routing Controller or RC) or protocol specific
      (Protocol Controller or PC).

   Routing Controller (RC): handles (abstract) information needed for
      routing and the routing information exchange with peering RCs by
      operating on the RDB.  The RC has access to a view of the RDB. 
      The RC is protocol independent.

   Note: Since the RDB may contain routing information pertaining to
      multiple RAs (and possibly to multiple layer networks), the RCs
      accessing the RDB may share the routing information.

   Link Resource Manager (LRM): supplies all the relevant component and
      TE link information to the RC.  It informs the RC about any state
      changes of the link resources it controls.

   Protocol Controller (PC): handles protocol-specific message exchanges
      according to the reference point over which the information is
      exchanged (e.g., E-NNI, I-NNI), and internal exchanges with the
      RC. The PC function is protocol dependent.

Authors' Addresses

   Andrew G. Malis
   Verizon Communications
   117 West St.
   Waltham MA 02451 USA

   EMail: andrew.g.malis@verizon.com


   Acee Lindem
   Ericsson
   102 Carric Bend Court
   Cary, NC 27519 

   EMail: acee.lindem@ericsson.com












Malis                  Expires December 27, 2010               [Page 20]
